HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/standingWave/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field       alpha.water;
type        sin;
direction   (1 0 0);
up          (0 0 1);
centre      (-0.5 0 0.5);
period      2;
amplitude   0.05;

// ************************************************************************* //
